// 1 . დაწერეთ ფუნქცია რომელიც დააბრუნებს ციფრის ფაქტორიალს
// მაგალითად თუ გადავცემთ 4-ს ფუნქციამ უნდა დააბრუნოს 24
// ანუ - 1 * 2 * 3 * 4 = 24


// function factorial(){
    
//     var fact=4
    
//     for( let i=1 ; i<4 ; i++){
//         fact=fact*i
        
//     }
    
// return fact
// }
// console.log(factorial(4))

// 2.
// დაწერეთ ფუნქცია რომელიც გადაუვლის ციფრებს 1 დან 100 მდე
// თუ ციფრი არის 3 ის და 5 ის ჯერადი დააკონსოლეთ "ორივეს ჯერადია"
// თუ მხოლოდ 3 -ის ჯერადია დააკონსოლეთ "სამის ჯერადია"
// თუ მხოლოდ 5 - ის ჯერადია დააკონსოლეთ "ხუთის ჯერადია"
// თუ არცერთის არ არის, არაფერი არ მინდა : )
// function number(x){
    
    
//     for (let i=1; i<100; i++){
//         if(x%15===0){console.log("ორივეს ჯერადია")}
//         else if(x%3===0){
//             console.log("სამის ჯერადია")
//         }
//         else if (x%5===0){
//             console.log("ხუთის ჯერადია")
//         }
        
       
//     }
   
// }
// console.log(number(5))

// 3. დაწერეთ ფუნქცია რომელსაც გადავცემთ წინადადებას
// ფუნქციამ უნდა დაგვიბრუნოს წინადადებიდან ყველაზე დიდი სიტყვა
// მაგალითად თუ გადავცემთ "თორნიკე, გილოცავ დაბადების დღეს!"
// უნდა დაგვიბრუნოს - "დაბადების"

const words = ['თორნიკე, გილოცავ დაბადების დღეს']
for(let i = 0; i<words.length; i++){
      if  (words[i]> 5){
         
          
          console.log (words [i]),
        }
        
        
    
}


//4. დაწერეთ ფუნქცია რომელიც კონსოლში ფიფქებით დახატავს ასეთ რამეს
/*


*
**
***
****
*****
****
***
**
*


*/
